# Pandas

pandas is an open source library providing high-performance, easy-to-use data structures and data analysis tools for the Python programming language. In this notebook we will cover the following topics:

* Series
* DataFrame
* Dropping Entries
* Indexing, Selecting, Filtering
* Arithmetic and Data Alignment
* Function Application and Mapping
* Sorting
* Axis Indices with Duplicate Values
* Summarising and Computing Descriptive Statistics
* Cleaning Data
* Input and Output

For help please refer to [The official documentation page.](https://pandas.pydata.org/pandas-docs/stable/)

## Imports

In [2]:
import pandas as pd
import numpy as np

## Series
A Series is a one-dimensional array-like object containing an array of data and an associated array of data labels. The data can be any NumPy data type and the labels are the Series' indices.

In [3]:
# 1) Create a list
myList = [1, 2, 3, -3, 0, 2, 1]

# 2) Create a Series from myList
Series1 = pd.Series(myList)
Series1

0    1
1    2
2    3
3   -3
4    0
5    2
6    1
dtype: int64

Note that each element of the list now has an index when it's converted to a series.

In [4]:
Series1.values

array([ 1,  2,  3, -3,  0,  2,  1])

Get the index of the Series:

In [5]:
Series1.index

RangeIndex(start=0, stop=7, step=1)

Index objects are immutable and hold the axis labels and metadata such as names and axis names. Now let's create a series with a custom index:

In [6]:
Series2 = pd.Series(myList, index=['a', 'John', 'c', 'd', '-1', 'f', 'g'])
Series2

a       1
John    2
c       3
d      -3
-1      0
f       2
g       1
dtype: int64

Get a value from a Series:

In [7]:
Series2[2]

3

Verify the index number agains the index name:

In [10]:
Series2[2] == Series2['c']

True

In [11]:
Series2['c']

3

Get a set of values from a Series by passing in a list of indices:

In [12]:
Series2[['a', '-1', 'John']]

a       1
-1      0
John    2
dtype: int64

Get values greater than 1:

In [13]:
Series2[Series2 > 1]

John    2
c       3
f       2
dtype: int64

Multiply by a scalar:

In [14]:
Series2 * 5

a        5
John    10
c       15
d      -15
-1       0
f       10
g        5
dtype: int64

Apply a function

In [15]:
np.exp(Series2)

a        2.718282
John     7.389056
c       20.085537
d        0.049787
-1       1.000000
f        7.389056
g        2.718282
dtype: float64

A Series is like a fixed-length, ordered dictionary. We can create a series from dictionaries:

In [17]:
# 1) Create a dictionary with keys as: A, B, C and values as 1, 2, 100
dict1 = {'A': 1, 'B': 2, 'C': 100}
# Create a Series from the dictionary
Series3 = pd.Series(dict1)
Series3

A      1
B      2
C    100
dtype: int64

Note that the keys have become the indices in the Series.

We can also re-order a Series by passing in an index list (indices which are not found are considered as `NaN`) when creating from a dictionary:

In [18]:
index_list = ['C', 'B', 'A', 'D']
Series4 = pd.Series(dict1, index=index_list)
Series4

C    100.0
B      2.0
A      1.0
D      NaN
dtype: float64

We can also check for `NaN`s:

In [24]:
Series4.isnull()

C    False
B    False
A    False
D     True
dtype: bool

In [27]:
Series4[Series4.isnull()]

D   NaN
dtype: float64

Or:

In [28]:
pd.isnull(Series4)

C    False
B    False
A    False
D     True
dtype: bool

Series automatically aligns differently indexed data in arithmetic operations:

In [29]:
Series3

A      1
B      2
C    100
dtype: int64

In [30]:
Series4

C    100.0
B      2.0
A      1.0
D      NaN
dtype: float64

In [31]:
Series3 + Series4

A      2.0
B      4.0
C    200.0
D      NaN
dtype: float64

We can also name a Series and its index:

In [32]:
Series4.name = "myName"
Series4.index.name = "myIndex"
Series4

myIndex
C    100.0
B      2.0
A      1.0
D      NaN
Name: myName, dtype: float64

We can rename a Series' index in place:

In [33]:
Series4.index = ["CC", "BB", "AA", "DD"]
Series4

CC    100.0
BB      2.0
AA      1.0
DD      NaN
Name: myName, dtype: float64

---

## DataFrame

A DataFrame is a tabular data structure containing an ordered collection of columns.  Each column can have a different type.  DataFrames have both row and column indices.  Row and column operations are treated roughly symmetrically.  Columns returned when indexing a DataFrame are views of the underlying data, not a copy.  To obtain a copy, use the copy() method.

Pandas can create DataFrames in different ways (e.g., reading in a file (txt, json, csv), or from a dictionary). Let's start by creating a DataFrame from a dictionary:

In [34]:
#1) Create a dictionary
dict2 = {'City':['London', 'London', 'London', "New york", "New York"],
         'Year':[2015, 2016, 2017, 2016, 2017],
         'Population': [8.60, 8.71, 8.79, 8.61, 8.62]   
}

#2) Create a DataFrame from the dictionary
df1 = pd.DataFrame(dict2)
df1

       City  Year  Population
0    London  2015        8.60
1    London  2016        8.71
2    London  2017        8.79
3  New york  2016        8.61
4  New York  2017        8.62

Create a DataFrame specifying a sequence of columns:

In [35]:
df2 = pd.DataFrame(dict2, columns=["Year", "City", "Population"])
df2

   Year      City  Population
0  2015    London        8.60
1  2016    London        8.71
2  2017    London        8.79
3  2016  New york        8.61
4  2017  New York        8.62

Like Series, columns that are not present in the data are `NaN`:

In [36]:
df3 = pd.DataFrame(dict2, columns=["Year", "City", "Population",
                                   "Unemployment"])
df3

   Year      City  Population Unemployment
0  2015    London        8.60          NaN
1  2016    London        8.71          NaN
2  2017    London        8.79          NaN
3  2016  New york        8.61          NaN
4  2017  New York        8.62          NaN

We can retrieve a column by the column name, returning a Series:

In [38]:
df3['City']

0      London
1      London
2      London
3    New york
4    New York
Name: City, dtype: object

We can retrieve a column by attribute, returning a Series:

In [39]:
df3.City

0      London
1      London
2      London
3    New york
4    New York
Name: City, dtype: object

We can retrieve a row by position:

In [40]:
df3.iloc[2]

Year              2017
City            London
Population        8.79
Unemployment       NaN
Name: 2, dtype: object

We can update a column by assignment:

In [41]:
df3

   Year      City  Population Unemployment
0  2015    London        8.60          NaN
1  2016    London        8.71          NaN
2  2017    London        8.79          NaN
3  2016  New york        8.61          NaN
4  2017  New York        8.62          NaN

In [43]:
df3["Unemployment"] = np.arange(5)
df3

   Year      City  Population  Unemployment
0  2015    London        8.60             0
1  2016    London        8.71             1
2  2017    London        8.79             2
3  2016  New york        8.61             3
4  2017  New York        8.62             4

We can assign a Series to a column (note if assigning a list or array, the length must match the DataFrame, unlike a Series):

In [44]:
unemployment = pd.Series([5.9, 6.0, 6.2], index=[2, 3, 4])
df3["Unemployment"] = unemployment
df3

   Year      City  Population  Unemployment
0  2015    London        8.60           NaN
1  2016    London        8.71           NaN
2  2017    London        8.79           5.9
3  2016  New york        8.61           6.0
4  2017  New York        8.62           6.2

We can assign a new column that doesn't exist to any existing column to create a new column (a copy):

In [45]:
df3['Misc'] = df3['City']
df3

   Year      City  Population  Unemployment      Misc
0  2015    London        8.60           NaN    London
1  2016    London        8.71           NaN    London
2  2017    London        8.79           5.9    London
3  2016  New york        8.61           6.0  New york
4  2017  New York        8.62           6.2  New York

We can also delete the column:

In [46]:
del df3["Misc"]
df3

   Year      City  Population  Unemployment
0  2015    London        8.60           NaN
1  2016    London        8.71           NaN
2  2017    London        8.79           5.9
3  2016  New york        8.61           6.0
4  2017  New York        8.62           6.2

We can create a DataFrame from a nested dictionary of dicts (the keys in the inner dicts are unioned and sorted to form the index in the result, unless an explicit index is specified):

In [47]:
population  = {'London': {2015: 8.6, 2016:8.71, 2017:8.79},
              'New York': {2016:8.61, 2017:8.62}
              }
df4 = pd.DataFrame(population)
df4

      London  New York
2015    8.60       NaN
2016    8.71      8.61
2017    8.79      8.62

We can transpose a DataFrame:

In [50]:
df4.T

          2015  2016  2017
London     8.6  8.71  8.79
New York   NaN  8.61  8.62

We can set an index name for the DataFrame:

In [51]:
df4.index.name = "year"
df4

      London  New York
year
2015    8.60       NaN
2016    8.71      8.61
2017    8.79      8.62

We can also set a name for the DataFrame columns

In [52]:
df4.columns.name="City"
df4

City  London  New York
year
2015    8.60       NaN
2016    8.71      8.61
2017    8.79      8.62

Return the data contained in a DataFrame as a 2d array:

In [53]:
df4.values

array([[8.6 ,  nan],
       [8.71, 8.61],
       [8.79, 8.62]])

## Dropping Entries

In [54]:
df3

   Year      City  Population  Unemployment
0  2015    London        8.60           NaN
1  2016    London        8.71           NaN
2  2017    London        8.79           5.9
3  2016  New york        8.61           6.0
4  2017  New York        8.62           6.2

Drop rows from a Series or DataFrame:

In [55]:
df5 = df3.drop([0])
df5

   Year      City  Population  Unemployment
1  2016    London        8.71           NaN
2  2017    London        8.79           5.9
3  2016  New york        8.61           6.0
4  2017  New York        8.62           6.2

Drop columns from a DataFrame:

In [62]:
df6 = df5.drop("Unemployment", axis=1)
df6

   Year      City  Population
1  2016    London        8.71
2  2017    London        8.79
3  2016  New york        8.61
4  2017  New York        8.62

## Indexing, Selecting, Filtering in DataFrames

In [63]:
df3

   Year      City  Population  Unemployment
0  2015    London        8.60           NaN
1  2016    London        8.71           NaN
2  2017    London        8.79           5.9
3  2016  New york        8.61           6.0
4  2017  New York        8.62           6.2

Select specified columns from a DataFrame:

In [64]:
df3[["Population", "City"]]

   Population      City
0        8.60    London
1        8.71    London
2        8.79    London
3        8.61  New york
4        8.62  New York

Select a slice from a DataFrame:

In [66]:
df3[0:3]

   Year    City  Population  Unemployment
0  2015  London        8.60           NaN
1  2016  London        8.71           NaN
2  2017  London        8.79           5.9

or

In [68]:
df3.iloc[0:3]

   Year    City  Population  Unemployment
0  2015  London        8.60           NaN
1  2016  London        8.71           NaN
2  2017  London        8.79           5.9

Select from a DataFrame based on a filter:

In [70]:
df3[df3["Population"] > 8.7]

   Year    City  Population  Unemployment
1  2016  London        8.71           NaN
2  2017  London        8.79           5.9

or

In [71]:
df3.loc[df3.Population > 8.7]

   Year    City  Population  Unemployment
1  2016  London        8.71           NaN
2  2017  London        8.79           5.9

Select a slice of rows from a specific column of a DataFrame:

In [72]:
df3.loc[0:2, "Population"]

0    8.60
1    8.71
2    8.79
Name: Population, dtype: float64

## Arithmetic and Data Alignment

Adding DataFrame objects results in the union of index pairs for rows and columns if the pairs are not the same, resulting in `NaN` for indices that do not overlap:

In [76]:
np.random.seed(0)
df7 = pd.DataFrame(np.random.rand(9).reshape(3, 3), columns=['a', 'b', 'c'])
df7

          a         b         c
0  0.548814  0.715189  0.602763
1  0.544883  0.423655  0.645894
2  0.437587  0.891773  0.963663

In [77]:
np.random.seed(1)
df8 = pd.DataFrame(np.random.rand(9).reshape(3, 3), columns=['b', 'c', 'd'])
df8

          b         c         d
0  0.417022  0.720324  0.000114
1  0.302333  0.146756  0.092339
2  0.186260  0.345561  0.396767

In [78]:
df7 + df8

    a         b         c   d
0 NaN  1.132211  1.323088 NaN
1 NaN  0.725987  0.792650 NaN
2 NaN  1.078033  1.309223 NaN

In [79]:
df9 = df8.add(df7, fill_value=0)
df9

          a         b         c         d
0  0.548814  1.132211  1.323088  0.000114
1  0.544883  0.725987  0.792650  0.092339
2  0.437587  1.078033  1.309223  0.396767

In [80]:
df10 = df8.sub(df9, fill_value=0)
df10

          a         b         c    d
0 -0.548814 -0.715189 -0.602763  0.0
1 -0.544883 -0.423655 -0.645894  0.0
2 -0.437587 -0.891773 -0.963663  0.0

In [81]:
df8.subtract(df9, fill_value=0)

          a         b         c    d
0 -0.548814 -0.715189 -0.602763  0.0
1 -0.544883 -0.423655 -0.645894  0.0
2 -0.437587 -0.891773 -0.963663  0.0

## Function Application and Mapping

Apply a function on 1D arrays to each column:

In [83]:
myFunc = lambda x: x.max() - x.min()

In [85]:
df10.apply(myFunc)

a    0.111226
b    0.468118
c    0.360899
d    0.000000
dtype: float64

Apply a function on 1D arrays to each row:

In [86]:
df10.apply(myFunc, axis=1)

0    0.715189
1    0.645894
2    0.963663
dtype: float64

## Sorting

In [88]:
df11 = pd.DataFrame(np.arange(12).reshape(3, 4),
                    index=["three", "one", "two"],
                   columns=["c", "a", "b", "d"]
                   )
df11

       c  a   b   d
three  0  1   2   3
one    4  5   6   7
two    8  9  10  11

Sort a DataFrame by its index:

In [89]:
df11.sort_index()

       c  a   b   d
one    4  5   6   7
three  0  1   2   3
two    8  9  10  11

Sort a DataFrame by columns in descending order:

In [90]:
df11.sort_index(axis=1, ascending=False)

        d  c   b  a
three   3  0   2  1
one     7  4   6  5
two    11  8  10  9

## Axis Indices with Duplicate Values

Labels do not have to be unique in Pandas:

Select DataFrame elements:

In [91]:
df12 = pd.DataFrame(np.random.randn(5, 4),
                   index=["foo", "foo", "bar", "bar", "baz"]
                   )
df12

            0         1         2         3
foo -2.363469  1.135345 -1.017014  0.637362
foo -0.859907  1.772608 -1.110363  0.181214
bar  0.564345 -0.566510  0.729976  0.372994
bar  0.533811 -0.091973  1.913820  0.330797
baz  1.141943 -1.129595 -0.850052  0.960820

In [93]:
df12.loc['bar']

            0         1         2         3
bar  0.564345 -0.566510  0.729976  0.372994
bar  0.533811 -0.091973  1.913820  0.330797

## Summarising and Computing Descriptive Statistics

Unlike NumPy arrays, Pandas descriptive statistics automatically exclude missing data.  NaN values are excluded unless the entire row or column is NA.

In [94]:
df3

   Year      City  Population  Unemployment
0  2015    London        8.60           NaN
1  2016    London        8.71           NaN
2  2017    London        8.79           5.9
3  2016  New york        8.61           6.0
4  2017  New York        8.62           6.2

In [95]:
df3.sum()

Year                                         10081
City            LondonLondonLondonNew yorkNew York
Population                                   43.33
Unemployment                                  18.1
dtype: object

Sum over the rows:

In [96]:
df3.sum(axis=1)

0    2023.60
1    2024.71
2    2031.69
3    2030.61
4    2031.82
dtype: float64

Account for NaNs:

In [97]:
df3.sum(axis=1, skipna=False)

0        NaN
1        NaN
2    2031.69
3    2030.61
4    2031.82
dtype: float64

## Cleaning Data
* Replace
* Drop
* Concatenate

### Replace

Replace all occurrences of a string with another string, in place (no copy):

In [98]:
df1

       City  Year  Population
0    London  2015        8.60
1    London  2016        8.71
2    London  2017        8.79
3  New york  2016        8.61
4  New York  2017        8.62

In [102]:
df1.replace('London', 'Lon', inplace=True)

In a specified column, replace all occurrences of a string with another string, in place (no copy):

In [104]:
df1.replace({'City': {'Lon': 'London'}}, inplace=True)
df1

       City  Year  Population
0    London  2015        8.60
1    London  2016        8.71
2    London  2017        8.79
3  New york  2016        8.61
4  New York  2017        8.62

### Drop

Drop the 'Population' column and return a copy of the DataFrame:

In [105]:
df1

       City  Year  Population
0    London  2015        8.60
1    London  2016        8.71
2    London  2017        8.79
3  New york  2016        8.61
4  New York  2017        8.62

In [107]:
df13 = df1.drop("Population", axis=1)
df13

       City  Year
0    London  2015
1    London  2016
2    London  2017
3  New york  2016
4  New York  2017

### Concatenate

Concatenate rows of two DataFrames:

In [108]:
dict3 = {'City': ['Manchester', 'Manchester', 'Manchester', 'Beijing', 'Beijing'],
        'Year': [2015, 2016, 2017, 2016, 2017],
        'Population': [2.7, 2.75, 2.81, 20.50, 21.01]
        }
df14 = pd.DataFrame(dict3)
df14

         City  Year  Population
0  Manchester  2015        2.70
1  Manchester  2016        2.75
2  Manchester  2017        2.81
3     Beijing  2016       20.50
4     Beijing  2017       21.01

In [109]:
df1

       City  Year  Population
0    London  2015        8.60
1    London  2016        8.71
2    London  2017        8.79
3  New york  2016        8.61
4  New York  2017        8.62

Concatenate columns of two DataFrames:

In [111]:
df15 = pd.concat([df1, df14], axis=0, sort=False)
df15

         City  Year  Population
0      London  2015        8.60
1      London  2016        8.71
2      London  2017        8.79
3    New york  2016        8.61
4    New York  2017        8.62
0  Manchester  2015        2.70
1  Manchester  2016        2.75
2  Manchester  2017        2.81
3     Beijing  2016       20.50
4     Beijing  2017       21.01

In [112]:
df16 = pd.concat([df1, df14], axis=1)
df16

       City  Year  Population        City  Year  Population
0    London  2015        8.60  Manchester  2015        2.70
1    London  2016        8.71  Manchester  2016        2.75
2    London  2017        8.79  Manchester  2017        2.81
3  New york  2016        8.61     Beijing  2016       20.50
4  New York  2017        8.62     Beijing  2017       21.01

## Input and Output
* Reading
* Writing

### Reading

In [113]:
data = pd.read_csv("oscar_age_female.csv")

In [114]:
data.head()

,Index,"""Year""","""Age""","""Name""","""Movie"""
1,1928,22,"""Janet Gaynor""","""Seventh Heaven","Street Angel and Sunrise: A Song of Two Humans"""
2,1929,37,"""Mary Pickford""","""Coquette""",NaN
3,1930,28,"""Norma Shearer""","""The Divorcee""\t",NaN
4,1931,63,"""Marie Dressler""","""Min and Bill""",NaN
5,1932,32,"""Helen Hayes""","""The Sin of Madelon Claudet""\t",NaN

In [115]:
data.describe()

             Index     "Year"
count    89.000000  89.000000
mean   1972.000000  36.123596
std      25.836021  11.745231
min    1928.000000  21.000000
25%    1950.000000  28.000000
50%    1972.000000  33.000000
75%    1994.000000  41.000000
max    2016.000000  80.000000

### Writing

In [ ]:
data.to_csv("new.csv")

# Boston Housing

In [117]:
from sklearn import datasets

In [118]:
Boston = datasets.load_boston()

In [124]:
pd.concat([pd.DataFrame(Boston.data, columns=Boston.feature_names), pd.DataFrame(Boston.target, columns=["PRICE"])], axis=1)

,CRIM,ZN,INDUS,CHAS,NOX,RM,AGE,DIS,RAD,TAX,PTRATIO,B,LSTAT,PRICE
0,0.00632,18.0,2.31,0.0,0.538,6.575,65.2,4.0900,1.0,296.0,15.3,396.90,4.98,24.0
1,0.02731,0.0,7.07,0.0,0.469,6.421,78.9,4.9671,2.0,242.0,17.8,396.90,9.14,21.6
2,0.02729,0.0,7.07,0.0,0.469,7.185,61.1,4.9671,2.0,242.0,17.8,392.83,4.03,34.7
3,0.03237,0.0,2.18,0.0,0.458,6.998,45.8,6.0622,3.0,222.0,18.7,394.63,2.94,33.4
4,0.06905,0.0,2.18,0.0,0.458,7.147,54.2,6.0622,3.0,222.0,18.7,396.90,5.33,36.2
5,0.02985,0.0,2.18,0.0,0.458,6.430,58.7,6.0622,3.0,222.0,18.7,394.12,5.21,28.7
6,0.08829,12.5,7.87,0.0,0.524,6.012,66.6,5.5605,5.0,311.0,15.2,395.60,12.43,22.9
7,0.14455,12.5,7.87,0.0,0.524,6.172,96.1,5.9505,5.0,311.0,15.2,396.90,19.15,27.1
8,0.21124,12.5,7.87,0.0,0.524,5.631,100.0,6.0821,5.0,311.0,15.2,386.63,29.93,16.5
9,0.17004,12.5,7.87,0.0,0.524,6.004,85.9,6.5921,5.0,311.0,15.2,386.71,17.10,18.9
10,0.22489,12.5,7.87,0.0,0.524,6.377,94.3,6.3467,5.0,311.0,15.2,392.52,20.45,15.0
11,0.11747,12.5,7.87,0.0,0.524,6.009,82.9,6.2267,5.0,311.0,15.2,396.90,13.27,18.9
12,0.09378,12.5,7.87,0.0,0.524,5.889,39.0,5.4509,5.0,311.0,15.2,390.50,15.71,21.7
13,0.62976,0.0,8.14,0.0,0.538,5.949,61.8,4.7075,4.0,307.0,21.0,396.90,8.26,20.4
14,0.63796,0.0,8.14,0.0,0.538,6.096,84.5,4.4619,4.0,307.0,21.0,380.02,10.26,18.2
15,0.62739,0.0,8.14,0.0,0.538,5.834,56.5,4.4986,4.0,307.0,21.0,395.62,8.47,19.9
16,1.05393,0.0,8.14,0.0,0.538,5.935,29.3,4.4986,4.0,307.0,21.0,386.85,6.58,23.1
17,0.78420,0.0,8.14,0.0,0.538,5.990,81.7,4.2579,4.0,307.0,21.0,386.75,14.67,17.5
18,0.80271,0.0,8.14,0.0,0.538,5.456,36.6,3.7965,4.0,307.0,21.0,288.99,11.69,20.2
19,0.72580,0.0,8.14,0.0,0.538,5.727,69.5,3.7965,4.0,307.0,21.0,390.95,11.28,18.2
20,1.25179,0.0,8.14,0.0,0.538,5.570,98.1,3.7979,4.0,307.0,21.0,376.57,21.02,13.6
21,0.85204,0.0,8.14,0.0,0.538,5.965,89.2,4.0123,4.0,307.0,21.0,392.53,13.83,19.6
22,1.23247,0.0,8.14,0.0,0.538,6.142,91.7,3.9769,4.0,307.0,21.0,396.90,18.72,15.2
23,0.98843,0.0,8.14,0.0,0.538,5.813,100.0,4.0952,4.0,307.0,21.0,394.54,19.88,14.5
24,0.75026,0.0,8.14,0.0,0.538,5.924,94.1,4.3996,4.0,307.0,21.0,394.33,16.30,15.6
25,0.84054,0.0,8.14,0.0,0.538,5.599,85.7,4.4546,4.0,307.0,21.0,303.42,16.51,13.9
26,0.67191,0.0,8.14,0.0,0.538,5.813,90.3,4.6820,4.0,307.0,21.0,376.88,14.81,16.6
27,0.95577,0.0,8.14,0.0,0.538,6.047,88.8,4.4534,4.0,307.0,21.0,306.38,17.28,14.8
28,0.77299,0.0,8.14,0.0,0.538,6.495,94.4,4.4547,4.0,307.0,21.0,387.94,12.80,18.4
29,1.00245,0.0,8.14,0.0,0.538,6.674,87.3,4.2390,4.0,307.0,21.0,380.23,11.98,21.0
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
476,4.87141,0.0,18.10,0.0,0.614,6.484,93.6,2.3053,24.0,666.0,20.2,396.21,18.68,16.7
477,15.02340,0.0,18.10,0.0,0.614,5.304,97.3,2.1007,24.0,666.0,20.2,349.48,24.91,12.0
478,10.23300,0.0,18.10,0.0,0.614,6.185,96.7,2.1705,24.0,666.0,20.2,379.70,18.03,14.6
479,14.33370,0.0,18.10,0.0,0.614,6.229,88.0,1.9512,24.0,666.0,20.2,383.32,13.11,21.4
480,5.82401,0.0,18.10,0.0,0.532,6.242,64.7,3.4242,24.0,666.0,20.2,396.90,10.74,23.0
481,5.70818,0.0,18.10,0.0,0.532,6.750,74.9,3.3317,24.0,666.0,20.2,393.07,7.74,23.7
482,5.73116,0.0,18.10,0.0,0.532,7.061,77.0,3.4106,24.0,666.0,20.2,395.28,7.01,25.0
483,2.81838,0.0,18.10,0.0,0.532,5.762,40.3,4.0983,24.0,666.0,20.2,392.92,10.42,21.8
484,2.37857,0.0,18.10,0.0,0.583,5.871,41.9,3.7240,24.0,666.0,20.2,370.73,13.34,20.6
485,3.67367,0.0,18.10,0.0,0.583,6.312,51.9,3.9917,24.0,666.0,20.2,388.62,10.58,21.2
486,5.69175,0.0,18.10,0.0,0.583,6.114,79.8,3.5459,24.0,666.0,20.2,392.68,14.98,19.1
487,4.83567,0.0,18.10,0.0,0.583,5.905,53.2,3.1523,24.0,666.0,20.2,388.22,11.45,20.6
488,0.15086,0.0,27.74,0.0,0.609,5.454,92.7,1.8209,4.0,711.0,20.1,395.09,18.06,15.2
489,0.18337,0.0,27.74,0.0,0.609,5.414,98.3,1.7554,4.0,711.0,20.1,344.05,23.97,7.0
490,0.20746,0.0,27.74,0.0,0.609,5.093,98.0,1.8226,4.0,711.0,20.1,318.43,29.68,8.1
491,0.10574,0.0,27.74,0.0,0.609,5.983,98.8,1.8681,4.0,711.0,20.1,390.11,18.07,13.6
492,0.11132,0.0,27.74,0.0,0.609,5.983,83.5,2.1099,4.0,711.0,20.1,396.90,13.35,20.1
493,0.17331,0.0,9.69,0.0,0.585,5.707,54.0,2.3817,6.0,391.0,19.2,396.90,12.01,21.8
494,0.27957,0.0,9.69,0.0,0.585,5.926,42.6,2.3817,6.0,391.0,19.2,396.90,13.59,24.5
495,0.17899,0.0,9.69,0.0,0.585,5.670,28.8,2.7986,6.0,391.0,19.2,393.29,17.60,23.1
496,0.28960,0.0,9.69,0.0,0.585,5.390,72.9,2.7986,6.0,391.0,19.2,396.90,21.14,19.7
497,0.26838,0.0,9.69,0.0,0.585,5.794,70.6,2.8927,6.0,391.0,19.2,396.90,14.10,18.3
498,0.23912,0.0,9.69,0.0,0.585,6.019,65.3,2.4091,6.0,391.0,19.2,396.90,12.92,21.2
499,0.17783,0.0,9.69,0.0,0.585,5.569,73.5,2.3999,6.0,391.0,19.2,395.77,15.10,17.5
500,0.22438,0.0,9.69,0.0,0.585,6.027,79.7,2.4982,6.0,391.0,19.2,396.90,14.33,16.8
501,0.06263,0.0,11.93,0.0,0.573,6.593,69.1,2.4786,1.0,273.0,21.0,391.99,9.67,22.4
502,0.04527,0.0,11.93,0.0,0.573,6.120,76.7,2.2875,1.0,273.0,21.0,396.90,9.08,20.6
503,0.06076,0.0,11.93,0.0,0.573,6.976,91.0,2.1675,1.0,273.0,21.0,396.90,5.64,23.9
504,0.10959,0.0,11.93,0.0,0.573,6.794,89.3,2.3889,1.0,273.0,21.0,393.45,6.48,22.0
505,0.04741,0.0,11.93,0.0,0.573,6.030,80.8,2.5050,1.0,273.0,21.0,396.90,7.88,11.9